{
	"translation": {
		"special": {
			"name": "Martina Vilímová",
			"downloadCV": "Download resume",
			"followMe": "Follow me",
			"writeMe": "Write me",
			"settings": "Settings",
			"colorSwitch": "Color switch",
			"theme": "Light & Dark version",
			"designed": "Web designed",
			"backToHomePage": "Go to the home page"
		},
		"menu": {
			"aboutMe": "About me",
			"resume": "Resume",
			"knowledge": "Knowledge",
			"myWork": "My work",
			"contact": "Contact"
		},
		"homepage": {
			"firstName": "Martina ",
			"lastName": "Vilímová",
			"workWith": "I work with ",
			"article": "Website programming fascinated me and in a short time I became an IT enthusiast who is already beginning to understand developer slang and tries every day to discover the world of the frontend developer."
		},
		"aboutMe": {
			"level": "Junior ",
			"specialization": "Front-end",
			"birth": {
				"title": "Birth:",
				"info": "14. 7. 1996"
			},
			"place": {
				"title": "I'm located:",
				"info": "Czechia"
			},
			"city": {
				"title": "City:",
				"info": "Prague"
			},
			"phone": {
				"title": "Phone:",
				"info": "+420 728 445 052"
			},
			"email": {
				"title": "Email:",
				"info": "vilima.tul@gmail.com"
			},
			"job": {
				"title": "Employed:",
				"info": "freelancer"
			},
			"paragraph1": "You spend a third of your life at work, so I want to have a job that I enjoy, it makes me a sense and a good salary. I found these values in programming.",
			"paragraph2": "My strengths is diligence and the desire for self-improvement. I always try to move at least a little further. I hate being stuck in a problem, but also I love the joy of solving it. I like the creative and diverse creation of work and at the same time it provides a certain freedom. I am a purposeful and team player."
		},
		"resume": {
			"educationTitle": "Education",
			"education2": {
				"title": "Technical university of Liberec",
				"specialization": "Textile technologies, materials and nanomaterials",
				"time": "2015 - 2018",
				"paragraph": "At university, I gained knowledge about textile materials and their processing. I gained valuable laboratory experience in analysis, testing and research and I received the Dean's award for the bachelor's thesis - Centrifugal spinning of bicomponent fibers."
			},
			"education1": {
				"title": "Integrated trade secondary school of business, Pilsen",
				"specialization": "Creation and design of clothing",
				"time": "2011 - 2015",
				"paragraph": "The art school enriched me with knowledge of the history of art and fashion, mathematical construction of clothes and machine sewing their models. The school also increased my painting skills and helped me develop in the presentation of my created design series."
			},
			"experienceTitle": "IT Work experience",
			"experience1": {
				"title": "VIDIA-DESIGN s.r.o.",
				"specialization": "Encoder/Webmaster",
				"time": "November 2019",
				"paragraph": "Most of my job was to insert and edit website content (CMS). If necessary, I also made adjustments to the front-end code (HTML, CSS/LESS) and design elements (Photoshop, Adobe XD)."
			}
		},
		"knowledge": {
			"title": "What I met on the IT journey",
			"subtitle": "I didn't go to IT school nor do I have any similar education in this field. Nevertheless, I was very interested in this field, that I decided to give it a chance. I started the basics and gradually added more knowledge that I was interested in or that I needed for my work. I learned from information obtained on the Internet, played various games (for example CodeCombat), took a few courses, mostly from Czechitas, created small exercises or did projects with friends.",
			"titleAnchor": "My brief retrospective",

			"knowledge13": {
				"title": "Firebase",
				"specialization": "self-study",
				"time": "March 2021",
				"paragraph": "For publishing my sites, I learned to work with Firebase. I learned to base a project on this platform and set up the necessary infrastructure for it. I learned how to work with a firestore database using basic operations and learned user authentication."
			},
			"knowledge12": {
				"title": "TypeScript",
				"specialization": "self-study",
				"time": "January 2021",
				"paragraph": "For keep the structure of the code and eliminate errors, I learned the basics of TypeScript. In projects I started using things like interface / type, enum, generics. I tried to type all inputs and outputs and avoided using  type any. In JavaScript I learned more modern notations defined in ES6 (const, arrow function) and while working with data I also learned to work with functions in fields (map, filter, find, reduce, etc.)"
			},
			"knowledge11": {
				"title": "Styled components",
				"specialization": "self-study",
				"time": "January 2021",
				"paragraph": "When working on a new project in React, styling using Styled components was chosen. This library was new to me, but after reading the documentation, I quickly learned it. I learned to create stylized components, use literals, inherit styles from other components, use props, nesting, pseudo-elements, animations, etc. I tried very hard to follow the DRY principle in my code (don't repeat yourself)."
			},
			"knowledge10": {
				"title": "React - router, hooks, form",
				"specialization": "self-study",
				"time": "January 2021",
				"paragraph": "I've known about the React framework for a long time, but only now have I started to pay a lot of attention to it. Together with friends, we created a new project and learned everything important that this library offers. I learned to functionally program, create code in smaller functional parts, use props, hooks (useState, useEffect, useContext), switch content using React Router Dom and write forms and validate them using React Hook Form."
			},
			"knowledge9": {
				"title": "WordPress",
				"specialization": "workshop - WordPress 1",
				"time": "October 2020",
				"paragraph": "I've often heard of software that easily and quickly creates a website, so I wanted to know more about it. That's why I attended an online course on WordPress, where I learned how to install and set up this open-source CMS, learned what are templates and plugins, and created a simple website during the course."
			},
			"knowledge8": {
				"title": "JavaScript",
				"specialization": "workshop - JavaScript 1 a 2",
				"time": "September 2020",
				"paragraph": "I really enjoy coding, but I wanted to move a little further again and start inserting a bit of logic into my code. I first learned JavaScript at home and later took two courses, where I really learned my knowledge of variables, conditions, cycles and functions. I then practiced JavaScript a lot in the game CodeCombat."
			},
			"knowledge7": {
				"title": "CSS grid, BEM, Sass, Eleventy",
				"specialization": "workshop - I create a website from A to Z 2",
				"time": "August 2020",
				"paragraph": "Courses always give me a lot of information in a short time, so I enrolled in a weekly course from Czechitas, where I learned many new and great things every day. Besides flexbox and Bootstrap, I have now learned to create a responsive layout using a CSS grid. I learned how to write class names according to the BEM methodology. I expanded my knowledge with another Sass preprocessor and learned to create templates and do a project in the Eleventy static site generator with text file editing."
			},
			"knowledge6": {
				"title": "Bootstrap",
				"specialization": "workshop - Bootstrap",
				"time": "August 2020",
				"paragraph": "A responsive layout is an absolute necessity of a website today, that's why I decided to take part in another workshop from Czechitas, this time on the topic of Bootstrap. During the day, I learned to embed the framework in my project, the basic techniques of responsive web design, the use of utilities or finished components and editing styles."
			},
			"knowledge5": {
				"title": "React",
				"specialization": "workshop - Tech meetup React",
				"time": "July 2020",
				"paragraph": "I didn't know much about React at that time, but I was interested in this JavaScript library, so I didn't hesitate and signed up for the online workshop Tech meetup React from Czechitas. The creation of a class component and a functional component, props, component state, REST API, React Router was discussed."
			},
			"knowledge4": {
				"title": "Git, Sourcetree",
				"specialization": "self-study, job - Vidia Design s.r.o. ",
				"time": "November 2019",
				"paragraph": "While working in a team, I learned to use a git program called Sourcetree so that I could publish my code to a common repository. I learned to work with branches, download new content (git pull), create commits and insert my work (git push)."
			},
			"knowledge3": {
				"title": "Less, Flexbox",
				"specialization": "self-study, job - Vidia Design s.r.o. ",
				"time": "November 2019",
				"paragraph": "When I started working, I had to learn a lot of new things that I knew nothing about. I learned about responsive web design and created web layouts using flexbox and media query. I also learned to write styles to the LESS preprocessor and took advantage of its benefits such as variables, mixins, nesting, functions, etc."
			},
			"knowledge2": {
				"title": "CSS",
				"specialization": "self-study",
				"time": "July 2019",
				"paragraph": "I really enjoyed CSS (cascading styles sheets). We played with colors, sizes, alignments and positions. First I wrote the styles directly into the HTML elements and then into an external file. I learned to use different properties, selector types, pseudo-classes and pseudo-elements."
			},
			"knowledge1": {
				"title": "HTML",
				"specialization": "self-study",
				"time": "July 2019",
				"paragraph": "HTML is the basis. I learned to write paired tags (start tag and end tag), unpaired tags (empty elements) and their attributes. She observed differences between block and inline elements. It created texts, links, images, lists, tables, navigations, forms, etc."
			}
		},
		"myWork": {
			"button": {
				"all": "all",
				"ownWork": "own work",
				"cooperation": "cooperation"
			},
			"pagination": {
				"morePages": "Load more items",
				"lessPages": "Load fewer items"
			},
			"description": {
				"projectDescription": "Project description",
				"createdProject": "Created the project:",
				"skills": "Skills:",
				"lastUpdate": "My last update:"
			},
			"myWork8": {
				"title": "Aj-tý spojka",
				"description": "",
				"skills": "React / Styled Component / Firebase",
				"updateDate": "Stále ve vývoji"
			},
			"myWork7": {
				"title": "Osobní portfolio",
				"description": "",
				"skills": "React / Styled Component / Firebase",
				"updateDate": "June 2021"
			},
			"myWork6": {
				"title": "Pokemon",
				"description": "",
				"skills": "React",
				"updateDate": "June 2021"
			},
			"myWork5": {
				"title": "Kafíčkáři",
				"description": "",
				"skills": "WordPress",
				"updateDate": "November 2020"
			},
			"myWork4": {
				"title": "Cestovka",
				"description": "",
				"skills": "Sass / BEM / CssGrid",
				"updateDate": "August 2020"
			},
			"myWork3": {
				"title": "Kadeřnictví Scissors",
				"description": "",
				"skills": "Boostrap",
				"updateDate": "August 2020"
			},
			"myWork2": {
				"title": "Eagle fitness",
				"description": "",
				"skills": "HTML / CSS / JS",
				"updateDate": "February 2020"
			},
			"myWork1": {
				"title": "Auto od strejdy",
				"description": "",
				"skills": "HTML / CSS",
				"updateDate": "September 2019"
			}
		},
		"contact": {
			"name": "Name *",
			"nameErrorRequired": "Please enter your name.",
			"nameErrorPattern": "Use only letters.",
			"nameErrorMax": "Your name is too long.",
			"nameErrorMin": "Enter your full name.",
			"email": "Email *",
			"emailErrorRequired": "Please enter your email.",
			"emailErrorPattern": "Invalid email address format.",
			"emailErrorMax": "Your email is longer than 254 letters.",
			"subject": "Subject *",
			"subjectPlaceholder": "I'm looking for a developer",
			"subjectErrorRequired": "Please enter the subject of your message.",
			"subjectErrorPattern": "There is an unsupported symbol in the text.",
			"subjectErrorMax": "Your subject is unnecessarily long.",
			"subjectErrorMin": "Your subject is too short.",
			"message": "Message *",
			"messagePlaceholder": "Write me the reason for your connection ...",
			"messageErrorRequired": "Please write me the reason for your connection.",
			"captchaErrorRequired": "Please confirm that you are not a robot.",
			"submit": "SEND"
		},
		"successfullySent": {
			"title": "Message was successfully sent.",
			"sentence1": "Thank you for it that choosing to contact me.",
			"sentence2": "I will try to respond to your message as soon as possible to the email you provided in the form."
		},
		"error": {
			"title": "I searched everywhere, but I didn't really find this page.",
			"sentence1": "Please make sure you did not make a mistake in the URL.",
			"sentence2": "It is also possible that the page has been moved or completely deleted."
		}
	}
}
